[
  {
    "text": "Все проблемы в программировании решаются путём создания дополнительного уровня косвенности. Обычно это создает новую проблему",
    "author": "Дэвид Виллер"
  },
  {
    "text": "Простота – предпосылка надежности",
    "author": "Эдсгер Дейкстра"
  },
  {
    "text": "Код сложнее читать, чем писать",
    "author": "Джоэль Спольски"
  },
  {
    "text": "Любой дурак может писать код, который будет понятен компьютерам. Хорошие программисты пишут код, который будет понятен людям",
    "author": "Мартин Фаулер"
  },
  {
    "text": "Не повторяйтесь. Каждый фрагмент знания должен иметь единственное, однозначное, надежное представление в системе",
    "author": "Энди Хант и Дэвид Томас"
  },
  {
    "text": "Код никогда не лжет, а вот с комментариями такое случается",
    "author": "Рон Джеффрис"
  },
  {
    "text": "В компьютерных науках есть только две сложные проблемы – аннулирование кэша и придумывание названий",
    "author": "Фил Карлтон"
  },
  {
    "text": "Когда я не знаю, с чего начать, я открываю чистый файл и пишу: ’// С чего бы начать?’. Дальше всё идёт как-то само собой",
    "author": "Расмус Лердорф"
  },
  {
    "text": "Если ваша работа не документирована, значит вы не работали",
    "author": "Ада Лавлейс"
  },
  {
    "text": "Писать книги сложнее, чем писать программы. Любой писатель может стать хотя бы посредственным программистом. Обратное, к сожалению, неверно",
    "author": "Дональд Эрвин Кнут"
  },
  {
    "text": "На собеседованиях я обычно спрашиваю, часто ли испытуемый использует костыли. Это хороший способ отсеять патологических лжецов",
    "author": "Стив Возняк"
  },
  {
    "text": "Всегда начинайте со структуры данных",
    "author": "Джон Кармак"
  },
  {
    "text": "Когда-то я был достаточно наивен, надеясь, что мне достаточно будет хорошо выучить один язык",
    "author": "Давид Хейнемейер Ханссон"
  },
  {
    "text": "Если отладка — процесс удаления ошибок, то программирование должно быть процессом их внесения",
    "author": "Эдсгер Дейкстра"
  },
  {
    "text": "Отладка кода вдвое сложнее, чем его написание. Так что если вы пишете код настолько умно, насколько можете, то вы по определению недостаточно сообразительны, чтобы его отлаживать",
    "author": "Брайан Керниган"
  },
  {
    "text": "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня",
    "author": "Ларри Уолл"
  },
  {
    "text": "Большинство хороших программистов делают свою работу не потому, что ожидают оплаты или признания, а потому что получают удовольствие от программирования",
    "author": "Линус Торвальдс"
  },
  {
    "text": "Программы должны писаться для людей, которые будут их читать, а машины, которые будут эти программы исполнять — второстепенны",
    "author": "Гарольд (Хэл) Абельсон"
  },
  {
    "text": "Язык, который не меняет вашего представления о программировании, недостоин изучения",
    "author": "Алан Джей Перлис"
  },
  {
    "text": "Программирование — это сложно. Основные правила, на которых все строится, очень просты, но по мере разработки программа сама начинает вводить свои правила и законы. Таким образом, программист строит лабиринт, в котором сам же может и потеряться",
    "author": "Марейн Хавербеке"
  },
  {
    "text": "Если вы хотите, чтобы код было легко и быстро писать — делайте его удобным для чтения",
    "author": "Роберт (Uncle Bob) Мартин"
  },
  {
    "text": "Есть всего два типа языков программирования: те, на которые люди всё время ругаются, и те, которые никто не использует",
    "author": "Бьёрн Страуструп"
  },
  {
    "text": "Неработающая программа обычно приносит меньше вреда, чем работающая плохо",
    "author": "Дейв Томас"
  },
  {
    "text": "Преждевременная оптимизация — корень всех зол",
    "author": "Дональд Эрвин Кнут"
  },
  {
    "text": "Чтобы написать чистый код, мы сначала пишем грязный код, а затем рефакторим его",
    "author": "Роберт (Uncle Bob) Мартин"
  },
  {
    "text": "Помимо математических способностей, жизненно важным качеством программиста является исключительно хорошее владение родным языком",
    "author": "Эдсгер Дейкстра"
  },
  {
    "text": "Думаю, искусство программировать немногим сложнее других человеческих навыков. Программирование делает вас лучше точно так же, как вам помогают развиваться изучение иностранного языка, математики или чтение книг",
    "author": "Джек Дорси"
  },
  {
    "text": "Тестирование не позволяет обнаружить такие ошибки, как создание не того приложения",
    "author": "Стив Макконнелл"
  },
  {
    "text": "Некоторые люди во время решения некой проблемы думают: «Почему бы мне не использовать регулярные выражения?». После этого у них уже две проблемы…",
    "author": "Джейми Завински"
  },
  {
    "text": "Изучение программирования имеет такое же отношение к проектированию интерактивных систем, как обучение слепой печати к написанию стихов",
    "author": "Тед Нельсон"
  },
  {
    "text": "Трудность работы с программистом заключается в том, что вы не можете понять, что он делает, до тех пор, пока не стало слишком поздно",
    "author": "Сеймур Крэй"
  },
  {
    "text": "Меня два раза спрашивали [члены Парламента]: «Скажите на милость, мистер Бэббидж, что случится, если вы введёте в машину неверные цифры? Cможем ли мы получить правильный ответ?» Я не могу себе даже представить, какая путаница в голове может привести к подобному вопросу",
    "author": "Чарлз Бэббидж"
  },
  {
    "text": "Нельзя доверять коду, который вы не написали полностью сами",
    "author": "Кен Томпсон"
  },
  {
    "text": "Ограничение возможностей языка с целью предотвращения программистских ошибок в лучшем случае опасно",
    "author": "Бьёрн Страуструп"
  },
  {
    "text": "Дизайн языка программирования — это как прогулка по парку. Парку Юрского Периода",
    "author": "Ларри Уолл"
  },
  {
    "text": "Чтобы понять алгоритм, нужно его увидеть",
    "author": "Дональд Эрвин Кнут"
  },
  {
    "text": "Программированию обычно учат на примерах",
    "author": "Никлаус Вирт"
  },
  {
    "text": "Некоторые проблемы лучше не решать, а избегать",
    "author": "Тони Хоар"
  },
  {
    "text": "У меня был работающий компилятор и никто не прикасался к нему, поскольку, как они говорили мне «Компьютеры могут выполнять только вычисления, они не могут делать программы",
    "author": "Грейс Хоппер"
  },
  {
    "text": "Мы не можем перекладывать свои ошибки на используемые технологии",
    "author": "Тим Бернерс-Ли"
  },
  {
    "text": "Обучение программированию не может научить быть экспертом, также как и изучение кистей и красок не может превратить кого-либо в художника",
    "author": "Эрик Реймонд"
  },
  {
    "text": "Болтовня ничего не стоит. Покажите мне код",
    "author": "Линус Торвальдс"
  },
  {
    "text": "Опасайтесь багов в приведенном выше коде; я только доказал корректность, но не запускал его",
    "author": "Дональд Эрвин Кнут"
  },
  {
    "text": "Есть два способа создания дизайна программы. Один из них, это сделать его настолько простым, что в нем, очевидно, не будет недостатков. Другой способ — сделать его настолько запутанным, что в нем не будет очевидных недостатков",
    "author": "Тони Хоар"
  },
  {
    "text": "Для дилетанта лучшим пособием по программированию служит «Алиса в стране чудес»",
    "author": "Алан Джей Перлис"
  },
  {
    "text": "Управление сложностью является сущностью компьютерного программирования",
    "author": "Брайан Керниган"
  },
  {
    "text": "Помните, что обычно есть решение проще и быстрее того, что первым приходит вам в голову",
    "author": "Дональд Эрвин Кнут"
  },
  {
    "text": "Легче изобрести будущее, чем предсказать его",
    "author": "Алан Кэй"
  },
  {
    "text": "Магия перестаёт существовать после того, как вы понимаете, как она работает",
    "author": "Тим Бернерс-Ли"
  },
  {
    "text": "Люди считают, что программирование — это наука избранных, но в реальности все наоборот — просто много людей создают программы, которые используют чужие программы, как-будто строя стену из маленьких кирпичиков",
    "author": "Дональд Эрвин Кнут"
  }
]
